""" 基本數據類型 """
# python 基本數據類型
# int, float, bool, str, list, tuple, dict, set, None
# int: 整數
# float: 浮點數
# str: 字符串
# bool: 布爾值
# list: 列表
# tuple: 元組
# dict: 字典
# set: 集合
# None: 空值


# 數據類型的轉換
# int(x): 將 x 轉換為整數
# float(x): 將 x 轉換為浮點數
# str(x): 將 x 轉換為字符串
# list(x): 將 x 轉換為列表
# tuple(x): 將 x 轉換為元組
# dict(x): 將 x 轉換為字典


# 列表與元組的區別
# 列表是可變的，元組是不可變的
# 列表使用 [] 定義，元組使用 () 定義
# 列表有序，元組有序
# 列表元素可以修改，元組元素不可以修改
# 列表元素可以重複，元組元素不可以重複


# 字典與集合的區別
# 字典是一種映射關係，集合是一種無序的數據集合
# 字典使用 {} 定義，集合使用 {} 定義
# 字典元素是 key-value 的形式，集合元素是單個元素
# 字典元素是無序的，集合元素是有序的
# 字典元素 key 不可以重複，集合元素不可以重複

# *agrs, **kwargs 的區別
# *args: 接收任意數量的位置參數，返回元組
# **kwargs: 接收任意數量的關鍵字參數，返回字典

# 受保護的屬性和私有屬性
# _xxx: 受保護的屬性，外部可以訪問，但是不建議訪問
# __xxx: 私有屬性，外部不可以訪問
# __xxx__: 特殊屬性，可以直接訪問
